# **pymysql을 이용한 MariaDB 연동**
### connect() 함수를 이용하면 MySQL(MariaDB) host내 DB와 직접 연결할 수 있다.
- user: user name
- passwd: 설정한 패스워드
- host: DB가 존재하는 host
- db: 연결할 데이터베이스 이름
- charset: 인코딩 설정

In [1]:
import pymysql
conn = pymysql.connect(host='13.209.193.138',
                       port=3306,
                       user='root',
                       passwd='test',
                       db='mariaDB')
print(conn)

<pymysql.connections.Connection object at 0x000002229A76E070>

In [ ]:
cur = conn.cursor()
print(type(cur))
print("-----------------------")
sql = 'SELECT * FROM firstapp_xylocation' # select는 db를 불러오는 것
cur.execute(sql)
result = cur.fetchall()
print(type(result))
print(result)  
# conn.close()

## Cursor 객체 생성
- 연결한 DB와 상호작용하기 위해 cursor 객체를 생성해주어야 한다.
- 다양한 커서의 종류가 있지만, 데이터 분석가에게 익숙한 데이터프레임 형태로 결과를 쉽게 변환할 수 있도록 **딕셔너리** 형태로 결과를 반환해주는 **DictCursor**객체를 주로 사용한다.
- 일반 **Cursor**객체를 사용하면 결과가 일반적으로는 **튜플** 형태로 리턴된다.
___
- SELECT 명령을 위해 SQL 문을 따로 변수에 넣어주고 cursor.execute(sql) 을 사용해 SQL를 실행한다.
- 실행한 결과를 fetchall(), fetchone() 등으로 받아 온다.
___
- **fetchall()** - 모든 데이터를 한 번에 가져올 때 사용
- **fetchone()** - 한 번 호출에 하나의 행만 가져올 때 사용
- **fetchmany(n)** - n개만큼의 데이터를 가져올 때 사용
___

# fetchall 사용

In [ ]:
try:
    cur = conn.cursor()
    print(type(cur))
    print("-----------------------")
    sql = 'SELECT * FROM emp'
    cur.execute(sql)
    result = cur.fetchall()
    print(type(result))
    print(result)
    print("----------------------------------------------")
    print(type(result[0]))
    print(result[0])
    print("----------------------------------------------")
    print(len(result))
    print(len(result[0]))
    print("----------------------------------------------")
    for row in result:        
        print(f'{row[0]} {row[1]} {row[2]} {row[3]} {row[4]} {row[5]} {row[6]} {row[7]}')
finally:
    conn.close() # close를 하는 습관을 가져야한다.

In [ ]:
import pandas as pd
df = pd.DataFrame(result)
df

In [ ]:
df = pd.DataFrame(result, columns=["empno","ename","job","mgr","hiredate","sal", "comm", "deptno"])
df

# fetchone 사용
> 1개 출력 후 사라짐, 다음 실행하면 2번째 부터 출력, 다음 수행하면 3번째 부터 출력, 즉 다음 행부터 출력을 수행함.

In [ ]:
import pymysql
conn = pymysql.connect(host='database-big-a.cljkqcsbb9ok.ap-northeast-2.rds.amazonaws.com',port=3306,
                       user='edu01',passwd='multi1234!', db='edu01db')
try:
    cur = conn.cursor()
    sql = 'SELECT * FROM emp'
    cur.execute(sql)
    result = cur.fetchone() # 1번째 출력
    print(type(result))
    print(result)
    print("----------------------------------------------")
    result = cur.fetchone() # 2번째 출력
    print(type(result))
    print(result)
    print("----------------------------------------------")
    result = cur.fetchmany(3) # 3번째 부터 3개 출력
    print(type(result))
    print(result)
    print("----------------------------------------------")
    result = cur.fetchall() # 나머지 모두 출력
    print(type(result))
    print(result)
    print("----------------------------------------------")
    result = cur.fetchone() # 더 없슈!!
    print(result)
finally:
    conn.close()

# DictCursor
> 자동으로 df만들때 컬럼명이 설정된다.

In [ ]:
import pymysql
conn = pymysql.connect(host='database-big-a.cljkqcsbb9ok.ap-northeast-2.rds.amazonaws.com',port=3306,
                       user='edu01',passwd='multi1234!', db='edu01db', cursorclass=pymysql.cursors.DictCursor)
try:
    cur = conn.cursor()
    print(type(cur))
    print("-----------------------")
    sql = 'SELECT * FROM emp'
    cur.execute(sql)
    result = cur.fetchall()
    print(type(result))
    print(result)
    print("----------------------------------------------")
    print(type(result[0]))
    print(result[0])
    print("----------------------------------------------")
    print(len(result))
    print(len(result[0]))
    print("----------------------------------------------")
    for row in result:        
        print(f'{row["empno"]} {row["ename"]} {row["job"]} {row["mgr"]} {row["hiredate"]} {row["sal"]} {row["comm"]} {row["deptno"]}')
finally:
    conn.close()

In [37]:
import pandas as pd

In [ ]:
df = pd.DataFrame(result)
df

# sql - SELECT
> 'SELECT * FROM emp where deptno = 30 order by sal desc'

In [ ]:
import pymysql
conn = pymysql.connect(host='database-big-a.cljkqcsbb9ok.ap-northeast-2.rds.amazonaws.com',port=3306,
                       user='edu01',passwd='multi1234!', db='edu01db', cursorclass=pymysql.cursors.DictCursor)
try:
    cur = conn.cursor()
    print(type(cur))
    print("-----------------------")
    sql = 'SELECT * FROM emp where deptno = 30 order by sal desc'
    cur.execute(sql)
    result = cur.fetchall()
    print(type(result))
    print(result)
    print("----------------------------------------------")
    print(type(result[0]))
    print(result[0])
    print("----------------------------------------------")
    print(len(result))
    print(len(result[0]))
    print("----------------------------------------------")
    for row in result:        
        print(f'{row["empno"]} {row["ename"]} {row["job"]} {row["mgr"]} {row["hiredate"]} {row["sal"]} {row["comm"]} {row["deptno"]}')
finally:
    conn.close()

In [40]:
df2 = pd.DataFrame(result)
df2

   empno   ename       job   mgr    hiredate   sal  comm  deptno
0   7698   BLAKE   MANAGER  7839  1981-05-01  2850     0      30
1   7499   ALLEN  SALESMAN  7698  1981-02-20  1600   300      30
2   7844  TURNER  SALESMAN  7698  1984-10-08  1500     0      30
3   7521    WARD  SALESMAN  7698  1981-02-03  1250   500      30
4   7654  MARTIN  SALESMAN  7698  1981-10-22  1250  1400      30
5   7900   JAMES     CLERK  7698  1981-12-03   950     0      30

# db table 만들기(insert)

In [87]:
import pandas as pd
data = pd.read_csv('../data/forecast_xyLocation.csv')
# data.info()
# for i in range(3774):
# VALUES (data.iloc[i, 0], data.iloc[i, 1], data.iloc[i, 2], data.iloc[i, 3], data.iloc[i, 4], data.iloc[i, 5])
# data.iloc[0, 0] # 2행 1열
# data.iloc[1, 0] # 3행 1열
# data.iloc[2, 0] # 4행 1열
# data.iloc[3, 0] # 6행 1열
# data.iloc[4, 0] # 7행 1열
# data.iloc[5, 0] # 8행 1열

5019099000

In [89]:
import pymysql

conn = pymysql.connect(host='13.209.193.138',port=3306,user='root',passwd='test',db='mariaDB',charset="utf8")

try:
    cursorObject = conn.cursor()                                     
    insertStatement = "INSERT INTO firstapp_xylocation (l_id, l_si, l_goo, l_dong, l_x, l_y) VALUES (1111000000, '서울특별시', '종로구', NULL, 60, 127)"
    cursorObject.execute(insertStatement)
    conn.commit()

except Exception as e:
    print("Exeception occured:{}".format(e))
finally:    
    conn.close()

Exeception occured:(1064, "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near '[i, 0], data.iloc[i, 1], data.iloc[i, 2], data.iloc[i, 3], data.iloc[i, 4], data' at line 1")

# db table 만들기(creat)

In [107]:
import pymysql

conn = pymysql.connect(host='13.209.193.138',port=3306,user='root',passwd='test',db='mariaDB',charset="utf8")
try:
    cursorObject = conn.cursor()                                     
    sqlQuery = "CREATE TABLE chatData ( index int(15) PRIMARY KEY, question VARCHAR(100), answer VARCHAR(100))"
    cursorObject.execute(sqlQuery)
    rows = cursorObject.fetchall()
    for row in rows:
        print(row)
except Exception as e:
    print("Exeception occured:{}".format(e))
finally:    
    conn.close()

Exeception occured:(1064, "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near 'int(15) PRIMARY KEY, question VARCHAR(100), answer VARCHAR(100))' at line 1")

In [108]:
import pymysql

dbServerName    = '13.209.193.138'
dbUser          = "root"
dbPassword      = "test"
dbName          = "mariaDB"
charSet         = "utf8"
cusrorType      = pymysql.cursors.DictCursor

connectionObject   = pymysql.connect(host=dbServerName, user=dbUser, password=dbPassword,
                                     db=dbName, charset=charSet,cursorclass=cusrorType)

try:
    cursorObject = connectionObject.cursor()                                     
    sqlQuery = "CREATE TABLE IF NOT EXISTS chatData(id int, question varchar(100), answer varchar(100))"   
    cursorObject.execute(sqlQuery)
    sqlQuery = "show tables"   
    cursorObject.execute(sqlQuery)
    rows = cursorObject.fetchall()
    for row in rows:
        print(row)

    insertStatement = "INSERT INTO chatData (id, question, answer) VALUES (1,'test1','test1')"   
    cursorObject.execute(insertStatement)
    insertStatement = "INSERT INTO chatData (id, question, answer) VALUES (2,'test2','test1')"   
    cursorObject.execute(insertStatement)
    insertStatement = "INSERT INTO chatData (id, question, answer) VALUES (3,'test3','test3')"   
    cursorObject.execute(insertStatement)
    connectionObject.commit()

    sqlQuery = "select * from chatData"   
    cursorObject.execute(sqlQuery)
    rows = cursorObject.fetchall()

    for row in rows:
        print(row)

except Exception as e:
    print("Exeception occured:{}".format(e))
finally:    
    connectionObject.close()

{'Tables_in_mariaDB': 'auth_group'}
{'Tables_in_mariaDB': 'auth_group_permissions'}
{'Tables_in_mariaDB': 'auth_permission'}
{'Tables_in_mariaDB': 'auth_user'}
{'Tables_in_mariaDB': 'auth_user_groups'}
{'Tables_in_mariaDB': 'auth_user_user_permissions'}
{'Tables_in_mariaDB': 'chatData'}
{'Tables_in_mariaDB': 'django_admin_log'}
{'Tables_in_mariaDB': 'django_apscheduler_djangojob'}
{'Tables_in_mariaDB': 'django_apscheduler_djangojobexecution'}
{'Tables_in_mariaDB': 'django_content_type'}
{'Tables_in_mariaDB': 'django_migrations'}
{'Tables_in_mariaDB': 'django_session'}
{'Tables_in_mariaDB': 'firstapp_xylocation'}
{'Tables_in_mariaDB': 'mqttApp_message'}
{'Tables_in_mariaDB': 'mqttApp_message2'}
{'id': 1, 'question': 'test1', 'answer': 'test1'}
{'id': 2, 'question': 'test2', 'answer': 'test1'}
{'id': 3, 'question': 'test3', 'answer': 'test3'}

In [118]:
import pandas as pd
data = pd.read_csv('../data/Total_chat_data.csv')
data.head()

    question          answer Unnamed: 2
0  ﻿좋?� ?�침.        ?�녕?�세??        NaN
1   좋�? ?�침.         반갑?�니??        NaN
2   좋�? ?�침.    좋�? ?�침?�에??        NaN
3   좋�? ?�침.  간밤??별일 ?�으?�죠?        NaN
4   좋�? ?�침.      ?�녕?�십?�까?        NaN